Revit 2027 API
BuiltInFailures.RevisionCloudFailures.ProhibitSwitchFromIssuedRevision Property
 Can't remove cloud from an Issued Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProhibitSwitchFromIssuedRevision { get; }
Public Shared ReadOnly Property ProhibitSwitchFromIssuedRevision As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProhibitSwitchFromIssuedRevision {
	FailureDefinitionId^ get ();
}
static member ProhibitSwitchFromIssuedRevision : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace